# Assignment 3: Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/US_Baby_Names_right.csv'``.

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns=['Unnamed: 0','Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [5]:
baby_names.groupby('Gender').agg({'Name':pd.Series.nunique})  #unique names
#baby_names['Gender'].value_counts()   #all names

         Name
Gender
F       10929
M        8012

### Step 7. Group the dataset by name and assign to names

In [6]:
names = baby_names.groupby(baby_names['Name'])

### Step 8. How many different names exist in the dataset?

In [7]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [8]:
baby_names['Name'].value_counts()[:1]

Riley    1112
Name: Name, dtype: int64

### Step 10. How many different names have the least occurrences?

In [9]:
#baby_names['Name'].value_counts(ascending=True).head(3682)
baby_names['Name'].value_counts().nsmallest(keep='all').count()

3682

### Step 11. What is the median name occurrence?

In [10]:
baby_names['Name'].value_counts().median()

8.0

### Step 12. What is the standard deviation of names?

In [11]:
#no standard deviation of nominal data. But from name occurrence?
baby_names['Name'].value_counts().std()

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
#baby_names.describe()
baby_names.describe().loc[['mean','min','max','std','25%','50%','75%']]

        Unnamed: 0            Id         Year        Count
mean  2.830990e+06  2.830991e+06  2009.053190    34.850124
min   1.134900e+04  1.135000e+04  2004.000000     5.000000
max   5.647425e+06  5.647426e+06  2014.000000  4167.000000
std   1.652476e+06  1.652476e+06     3.138293    97.397346
25%   1.317326e+06  1.317328e+06  2006.000000     7.000000
50%   2.811920e+06  2.811921e+06  2009.000000    11.000000
75%   4.242554e+06  4.242556e+06  2012.000000    26.000000